#coding:utf-8

'''
编程免不了要写 配置文件的语言，非常简洁强大，远比JSon格式方便
yaml 是专门用来写配置文件的语言，
YaML ZAI PYTHON 语言中有PyYAML

一 简介 
YAML 语言的设计目标，就是方便人类读写。它实质上是一种通用的数据串行化格式
基本语法规则如下：
大小写敏感   使用缩进表示层级关系
缩进时不允许TAB，只用空格 
缩进空格数目不重要，只要相同层级的元素左侧对其即可 
#表示注释，

YAML 支持的数据结构有三种 ： 对象  键值对的集合   
                              数组  一组按次序排列的值 
          
                            纯量：单个的，不可再分的值。字符串、布尔值、整数、浮点数、Null、时间、日期
                            
                            使用方法：
https://www.cnblogs.com/shaosks/p/7344771.html
'''
















